#language: ru
  @001
  Функционал: Фильтрация товаров по бренду

    @001_1 @all_cases
    Структура сценария: : Фильтрация по бренду
      Когда пользователь выбирает категорию товара "Одежда"
      И выбирает бренд "<Название бренда>"
      Тогда отображаются товары выбранного бренда "<Название бренда>"
      И переходит на страницу первого товара
      Тогда у товара указан бренд "<Название бренда>"
      Примеры:
      | Название бренда |
      | Sela            |

    @001_2 @all_cases
    Сценарий: Фильтрация с указанием несуществующего бренда
      Когда пользователь выбирает категорию товара "Одежда"
      И выбирает бренд "test-brand"
      Тогда отображается сообщение о том, что бренд не найден