#language: ru
  Функционал: Фильтрация товаров по бренду
    @001
    @correct
    Сценарий: Фильтрация по бренду
      Когда пользователь выбирает категорию товара "Одежда"
      И выбирает бренд "adidas"
      Тогда отображаются товары выбранного бренда "adidas"

    @002
    @fail
    Сценарий: Фильтрация с указанием несуществующего бренда
      Когда пользователь выбирает категорию товара "Одежда"
      И выбирает бренд "adidas10"
      Тогда отображается сообщение о том, что бренд не найден