#language: ru
@002
Функционал: Сортировка товаров

  @002_1 @all_cases
  Сценарий: Сортировка по цене
    Когда пользователь выбирает категорию товара "Одежда"
    И выбирает бренд "adidas"
    И выбирает сортировку по цене по возрастанию
    Тогда товары отображаются по возрастанию цены

  @002_2 @all_cases
  Сценарий: Сортировка по размеру скидки
    Когда пользователь выбирает категорию товара "Одежда"
    И выбирает бренд "befree"
    И выбирает сортировку по размеру скидки
    Тогда товары отображаются по убыванию размера скидки