#language: ru
@005
Функционал: Задание диапазона цен

  @005_1 @all_cases
  Сценарий: Указание нечислового значения в поле максимальной цены
    Когда пользователь выбирает категорию товара "Одежда"
    И указывает максимальную цену "maxPrice"
    Тогда максимальная цена равна минимальной

  @005_2 @all_cases
  Сценарий: Указание значения ниже минимальной цены в поле максимальной цены
    Когда пользователь выбирает категорию товара "Одежда"
    И указывает максимальную цену "1"
    Тогда максимальная цена равна минимальной